<?php
//-------------------------------------------------

echo '//課題①'."\n";

$name=['鈴木洋介','鈴木洋輔'];
$trueName='鈴木洋介';


for ($i=0;$i<=1;$i++){
    if ($name[$i]==$trueName){
        echo '私は'.$name[$i].'です。';
    } else {
        echo $name[$i].'は私の名前ではありません。';
    }
    echo "\n";
}
echo "\n";

//-------------------------------------------------

echo '//課題②'."\n";

$SumI=0;

for ($j=1; $j<=10000; $j++){
    $SumI+=$j;
}

echo $SumI;
echo "\n"."\n";

//-------------------------------------------------

echo '//課題③'."\n";

$fruits=['葡萄','桃','檸檬','メロン','西瓜'];

foreach ($fruits as $fruit){
    echo '好きなフルーツは'.$fruit.'です。'."\n";
}
echo "\n";

//-------------------------------------------------

echo '//応用課題'."\n";

/*
$start = 1;
$end = 100;

for($i = $start; $i < $end; $i++){

  // 5で割り切れたら{}内を実行する
  if($i % 5 == 0){
    echo $i
  }
}
*/

/* for文の始めの値を定義する */     //注釈の指定ミス「/」→「*/」
$start = 1;
/* for文の終わりの値を定義する */
$end = 100;

for($i = $start; $i <= $end; $i++){ //繰り返し範囲の指定ミス「<」→「<=」

  // 5で割り切れたら{}内を実行する
  if($i % 5 == 0){
    echo $i;                        //行末の「；」が抜けている。
    echo "\n";                      //念のため改行。
  }
}